/* Force app update dialog message */
"AppUpdateAlertMessage" = "In order to add this issuer, you must have the latest version of Blockerts Wallet.";

/* Force app update dialog title */
"AppUpdateAlertTitle" = "Jekk Jogħġbok Aġġorna l-Blockcerts Wallet";

/* Sucessful credential import alert title */
"ImportComplete" = "Importazzjoni Kompluta";

/* Successful credential import alert message */
"CredentialImportSuccess" = "Dan il-kredenzjali ġie importat b'suċċess. Jista' jinstab fit-taqsima tal-emittent.";

/* Title for the screen with about passphrase info on it. */
"AboutPassphrase" = "About Passphrase";

/* Menu action item for sharing device logs. */
"AboutPassphrases" = "Dwar il-Passphrases";

/* Action item in settings screen to add an Issuer manually.
   Add credential in issuer detail
   Title in settings */
"AddCredential" = "Żid Kredenzjali";

/* Action item in settings screen to add an Issuer manually.
   Navigation title for the 'Add Issuer' form. */
"AddIssuer" = "Żid Emittent";

/* Alert title when adding an issuer fails for any reason. */
"AddIssuerFailAlertTitle" = "Add Issuer Failed";

/* Title when adding certificate in progress
   Title when adding issuer in progress */
"AddingCredential" = "Qed jiġi miżjud Kredenzjali";

/* Title when adding issuer in progress */
"AddingIssuer" = "L-Emittent qed jiġi miżjud";

/* Generic error when adding an issuer. */
"AddIssuerFailAlertMessage" = "Adding this issuer failed. Please try again";

/* Add issuer alert message */
"AddIssuerSuccess" = "An issuer was added. Please check your issuers screen.";

/* Confirmation before copying for backup */
"AreYouSure" = "Inti Ċert?";

/* Explain that we need them to authenticate in order to replace their passphrase. */
"AuthenticateReplacePassphrase" = "Authenticate to replace your secure passphrase.";

/* Prompt to authenticate in order to reveal their passphrase. */
"AuthenticateSeePassphrase" = "Authenticate to see your secure passphrase.";

/* Onboarding screen backup passphrase title */
"BackupPassphrase" = "Backup Passphrase";

/* Caution title presented when attempting to delete a certificate. */
"Caution" = "Kawtela!";

/* Email subject line when backing up passphrase */
"BlockcertsBackup" = "Blockcerts Backup";

/* Title of main interface */
"BlockcertsWallet" = "Blockcerts Wallet";

/* Button to cancel user action
   Cancel action
   Cancel the action sheet.
   Dismiss action */
"Cancel" = "Ikkanċella";

/* Button to cancel user action */
"Close" = "Close";

/* Generic error title. We couldn't delete a certificate. */
"DeleteFileError" = "Couldn't delete file";

/* Title for an error message displayed when we can't read a certificate file the user tried to import. */
"ReadFileError" = "Couldn't read file";

/* Alert title when sharing a certificate fails. */
"ShareCredentialError" = "Couldn't share certificate.";

/* Credential info screen field label */
"CredentialExpiration" = "Skadenza tal-Kredenzjali";

/* Title of credential information screen */
"CredentialInfo" = "Info tal-Kredenzjali";

/* Credential info screen field label */
"CredentialName" = "Isem il-Kredenzjali";

/* Label for the current passphrase. */
"CurrentPassphrase" = "Current Passphrase";

/* Credential info screen field label */
"DateIssued" = "Data tal-Ħruġ";

/* Confirm delete action */
"Delete" = "Ħassar";

/* Action to delete a credential in the metadata view. */
"DeleteCredential" = "Ħassar il-Kredenzjali";

/* Credential info screen field label */
"Description" = "Deskrizzjoni";

/* Button copy */
"Done" = "Lest";

/* Action item in settings screen. */
"EmailLogs" = "Email Logs";

/* Auth failure replacing passphrase */
"AuthenticationError" = "Failed to authenticate. Try again.";

/* Alert title when you re-import an existing certificate */
"FileAlreadyImported" = "File already imported";

/* Title for the failed-to-share-your-logs alert */
"FileNotFound" = "File not found";

/* Explanation of the effects of deleting a certificate. */
"DeleteCredentialExplanation" = "Jekk tħassar din il-kredenzjali u m'għandekx backup, ikollok titlob lill-emittent biex jibgħatha mill-ġdid jekk trid tirkupraha. Inti ċert li trid tħassar din il-kredenzjali?";

/* Contextual action. Tapping this prompts the user to add a file from a document provider. */
"ImportFromFile" = "Importa minn Fajl";

/* Contextual action. Tapping this prompts the user for a URL to pull the certificate from. */
"ImportFromURL" = "Importa minn URL";

/* Information about the passphrase */
"Information" = "Information";

/* Issuer info screen field label */
"IntroducedOn" = "Introduced on";

/* Imported certificate didn't parse title
   Title for an alert when importing an invalid certificate */
"InvalidCredential" = "Invalid Credential";

/* This describes the issuer cell in the collection view. It's an accessibility label read aloud for users with VoiceOver. */
"Issuer" = "Emittent";

/* Issuer View Header */
"Issuers" = "Emittenti";

/* Issuer info screen field label */
"IssuerContactEmail" = "Issuer Contact Email";

/* Title of credential information screen */
"IssuerInfo" = "Info tal-Emittent";

/* Issuer info screen field label */
"IssuerName" = "Isem l-Emittent";

/* Format string for an issuer response with a missing property. Variable is the property name that's missing. */
"IssuerMissingProperty" = "Issuer responded, but didn't include the \"%@\" property";

/* Format string for an issuer response with an invalid property. Variable is the property name that's invalid. */
"IssuerInvalidProperty" = "Issuer responded, but it contained an invalid property named \"%@\"";

/* Specific authentication error: The user's phone has local authentication disabled, so we can't show the passphrase. */
"LocalAuthenticationDisabled" = "It looks like local authentication is disabled for this app. Without it, showing your passphrase is insecure. Please enable local authentication for this app in Settings.";

/* A message displayed after clearing the logs successfully. */
"DeleteLogsSuccess" = "Logs have been deleted from this device.";

/* Error state: missing issuer data in issuer cell */
"MissingIssuer" = "Missing Issuer";

/* Action item in settings screen. */
"MyPassphrase" = "Il-Passphrase Tiegħi";

/* Credential info screen description of credential that never expires */
"Never" = "Qatt";

/* Onboarding screen label for New User */
"NewUser" = "Utent Ġdid";

/* Onboarding screen label for Current User */
"CurrentUser" = "Utent Attwali";

/* Video play button accessibility label */
"PlayButtonAccessibility" = "Ara l-intro video.";

/* Missing description text for issuer. */
"IssuerMissingDescription" = "No description provided.";

/* No network connection alert title */
"ReachabilityAlertTitle" = "No Network Connection";

/* Confirm action */
"OK" = "OK";

/* Button copy
   Button label
   Button to confirm user action
   OK dismiss action */
"Okay" = "Okay";

/* Navigation title for revealing the current passphrase. */
"Passphrase" = "Passphrase";

/* Title in alert view after processing failed user input */
"InvalidPassphrase" = "Passphrase Invalida";

/* No network connection alert message */
"ReachabilityAlertMessage" = "Please check your network connection and try again.";

/* Message to user to check the passphrase */
"CheckPassphraseTryAgain" = "Jekk jogħġbok iċċekkjaha u erġa' pprova.";

/* Specific authentication error: The user's phone has local authentication disabled, so we can't show the passphrase. */
"EnableAuthenticationPrompt" = "Please go to the Settings for Blockcerts Wallet and enable Touch ID, Face ID, or a passcode to secure your passphrase and try again.";

/* Generic authentication failure error. */
"GenericAuthenticationError" = "Please try to authenticate again to see your passphrase.";

/* Menu item in the settings screen that links to our privacy policy.
   Title for the screen with our privacy policy on it. */
"PrivacyPolicy" = "Strateġija tal-Privatezza";

/* Alert view title shown when unable to authenticate for My Passphrase */
"ProtectYourPassphrase" = "Protect Your Passphrase";

/* Replace passphrase action button */
"Replace" = "Replace";

/* Title for replacing the passphrase */
"ReplacePassphrase" = "Replace Passphrase";

/* Title for our specific warning about validating a sample certificate */
"SampleCredential" = "Sample Certificate";

/* Header for selecting backup methods */
"SelectOne" = "Jekk jogħġbok agħżel mill-inqas għażla waħda minn hawn taħt:";

/* Button for selecting backup methods */
"SelectOneButton" = "Agħżel mill-Inqas Waħda Biex Tkompli";

/* Manual Hard Copy */
"ManualHardCopy" = "Kopja Stampata tal-Manwal";

/* Copy to Email or Clipboard */
"CopyEmailClipboard" = "Ikkopja fuq Email jew Clipboard";

/* Title of the Settings screen. */
"Settings" = "Settings";

/* Action to share certificate file, presented in an action sheet. */
"ShareFile" = "Ikkondividi l-Fajl";

/* Action to share the certificate's hosting URL, presented in an action sheet. */
"ShareLink" = "Ikkondividi l-Link";

/* Issuer info screen field label */
"SharedAddress" = "Indirizz Ikkondiviż";

/* Action button for revealing the current passphrase */
"ShowPassphrase" = "Show Passphrase";

/* Generic error for failure to add an issuer */
"AddIssuerGenericError" = "Something went wrong adding this issuer. Try again later.";

/* Alert message when sharing a certificate fails. Generic error. */
"ShareCredentialGenericError" = "Something went wrong preparing that file for sharing. Try again later.";

/* Generic error description. We couldn't delete a certificate. */
"DeleteCredentialGenericError" = "Something went wrong when deleting that certificate.";

/* A longer explanation of the error message displayed when we can't read a certificate file the user tried to import. */
"CredentialParseError" = "Something went wrong when trying to open the file.";

/* action completed successfully
   Add issuers alert title
   Alert title */
"Success" = "Success!";

/* Imported title didn't parse message */
"InvalidCredentialFile" = "Dan ma jidhirx li hu fajl ta' kredenzjali validu. Jekk jogħġbok iċċekkjah u erġa' pprova.";

/* Invalid state error message when adding an issuer. */
"AppRestartRequired" = "The app is in an invalid state. Please quit the app & relaunch. Then try again.";

/* Error message when an identification request is aborted */
"RequestAborted" = "The request was aborted. Please try again.";

/* Error message when an identification request sees a server error */
"ServorError" = "The server encountered an error. Please try again.";

/* Error message displayed when adding issuer failed */
"AddIssuerFailMessage" = "There was an error adding this issuer. This can happen when a single-use invitation link is clicked more than once. Please check with the issuer and request a new invitation, if necessary.";

/* Scare tactic to warn user about insecurity of email */
"EmailBackupWarning" = "Dan huwa metodu ta' backup b'sigurtàbaxxa. Trid tkompli?";

/* Explanation for why you can't validate the sample certificate. */
"SampleCredentialVerificationImpossible" = "This is a sample certificate that cannot be verified. Real certificates will perform a live validation process.";

/* Enter Passphrase */
"EnterPassphrase" = "Daħħal il-Passphrase";

/* Enter Passphrase Instruction */
"EnterPassphraseInstruction" = "Jekk jogħġbok ikteb jew ippejstja l-passphrase tiegħek hawn:";

/* Error message when the issuer's data doesn't match the URL it's hosted at. */
"IssuerTampered" = "This issuer appears to have been tampered with. Please contact the issuer.";

/* Failure saving replacement passphrase */
"PassphraseSaveFail" = "Unable to save this passphrase.";

/* Issuer info screen field label */
"URL" = "URL";

/* Action prompt to view the imported certificate */
"View" = "View";

/* This error is presented when the user uses a bad nonce */
"IssuerAuthenticationError" = "We couldn't authenticate you to the issuer. Double-check your one-time code and try again.";

/* Explanation for failing to share the log file */
"DeviceMissingLogs" = "We couldn't find the logs on the device.";

/* Error message displayed when we see missing or invalid JSON in the response. */
"IssuerResponseErrorJSON" = "We couldn't understand this Issuer's response. Please contact the Issuer.";

/* Onboarding screen title */
"Welcome" = "Welcome";

/* Longer explanation about importing an existing file. */
"FileAlreadyImportedExplanation" = "You've already imported that file. Want to view it?";

/* Passphrase generated */
"PassphraseGenerated" = "Il-Passphrase Ġiet Iġġenerata!";

/* Passphrase description */
"PassphraseDescription" = "Din hija l-passphrase għall-wallet tiegħek. Hemm backup fuq dan it-telefon, imma jeħtieġ li toħloq waħda żejda f'każ li tibdel it-tagħmir.";

/* Create backup */
"CreateBackup" = "Oħloq Backup";

/* Select Backup Methods */
"SelectBackupMethods" = "Agħżel il-Metodi ta' Backup";

/* Instruction to save passphrase */
"WriteYourPassphrase" = "Ikteb il-passphrase tiegħek fuq biċċa karta u erfagħha f'post sigur.";

/* Welcome new user header */
"NewUserHeader" = "Lest!";

/* Welcome new user body */
"NewUserBody" = "Int ser tirċievi email meta l-emittent ikun lest biex jiżdied. Segwi l-link fl-email biex tlesti l-proċess.";

/* Welcome new user footer */
"NewUserFooter" = "Inti tista' żżid emittent manwalment billi żżur is-Settings u tagħżel Żid Emittent.";

/* Welcome returning user from app update header */
"UpdateUserHeader" = "Merħba għall-Blockcerts Wallet il-ġdid!";

/* Welcome returning user from app update body */
"UpdateUserBody" = "Aħna tejjibna din l-esperjenza, imma int se tkun tista' tirċievi u tamministra l-kredenzjali tiegħek bħal qabel. Jekk jogħġbok innota li issa għandek bżonn tagħmel backup tal-passphrase tiegħek, imma tista' tagħmel hekk faċilment fl-app. Agħfas il-buttuna Kompli sabiex tibda.";

/* Welcome returning user from app update body 2 */
"UpdateUserBody2" = "Please note that you are now required to back up your passphrase, but you can do so easily in the app.";

/* Welcome returning user from app update body 3 */
"UpdateUserBody3" = "Tap continue to begin.";

/* Welcome returning user header */
"ReturningUserHeader" = "Erġa' Importa il-Kredenzjali Tiegħek";

/* Welcome returning user body */
"ReturningUserBody" = "Biex tara l-emittenti tiegħek, mur fis-Settings biex iżżid il-kredenzjali tiegħek jew żidhom permezz tal-email mill-Emittent.";

/* Welcome returning user footer */
"ReturningUserFooter" = "Inti tista' żżid emittent manwalment billi żżur is-Settings u tagħfas fuq Żid Emittent.";

/* No credentials */
"NoCredentials" = "L-ebda Kredenzjali";

/* 1 credential */
"OneCredential" = "Kredenzjal 1";

/* Multiple credentials */
"MultipleCredentials" = "%@ Kredenzjali";

/* Empty Credentials View */
"EmptyCredentials" = "Inti ser tirċievi email meta jinħareġ kredenzjali. Segwi l-link fl-email biex tlesti l-proċess.";

/* Add Issuer Enter URL */
"EnterIssuerURL" = "Daħħal il-URL ipprovdut mill-emittent";

/* Add Issuer Enter Code */
"EnterIssuerCode" = "Daħħal il-kodiċi li jintuża darba";

/* Credential Info Button */
"Info" = "Info";

/* Credential Verify Button */
"Verify" = "Ivverifika";

/* Credential Share Button */
"Share" = "Ikkondividi";

/* Continue */
"Continue" = "Continue";

/* Credential */
"Credential" = "Kredenzjali";

/* Enter */
"Enter" = "Idħol";

/* Accessibility label for video play button in onboarding */
"PlayIntroVideo" = "Ara l-intro video.";

/* Accessibility label for issuer URL text field */
"IssuerURL" = "URL tal-Emittent";

/* Accessibility label for issuer code text field */
"OneTimeCode" = "Kodiċi li jintuża darba";

/* Accessibility label for credential URL text field */
"CredentialURL" = "Il-URL tal-Kredenzjali";

/* Verification */
"Verification" = "Verifika";

/* Credential verification in progress message */
"VerificationInProgress" = "Verifying %@ Credential... ";

/* Credential verification success message */
"VerificationSuccess" = "This is a valid %@ credential.";

/* Credential verification fail message */
"VerificationFail" = "Dan il-kredenzjali mhux ivverifikat. Jekk jogħġbok ikkuntattja lill-emittent.";

/* Credential verification success */
"Verified" = "Ivverifikat";

/* Choose credential import method */
"ChooseMethod" = "Agħżel metodu:";

/* Instruction to copy and paste credential URL */
"CopyCredentialURL" = "Jekk jogħġbok ikteb jew ippejstja l-URL tal-kredenzjali:";

/* Import */
"Import" = "Importa";

/* You have 1 credential */
"YouHaveOneCredential" = "Int għandek 1 kredenzjali";

/* You have multiple credentials */
"YouHaveMultipleCredentials" = "Int għandek %@ kredenzjali";

/* Share credential action sheet title */
"ShareCredential" = "Ikkondividi din il-Kredenzjali";

/* Title for SAML login */
"LoginToIssuer" = "Log In To Issuer";
